In [76]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OrdinalEncoder
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
from sklearn.metrics import precision_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import f1_score
from sklearn.utils import shuffle
from sklearn.metrics import roc_auc_score 
from sklearn.metrics import precision_recall_curve, recall_score

In [77]:
churn_data = pd.read_csv('/Users/leahdeyoung/Desktop/GitHub/beta-bank-practicum/Churn.csv', encoding = "utf-8")

In [78]:
display(churn_data.sample(10))
churn_data.info()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
7209,7210,15788131,Atkins,653,France,Male,47,NaN,0.00,1,1,0,50695.93,1
2129,2130,15664881,Norton,702,France,Male,34,4.0,100054.77,1,1,0,109496.45,0
6794,6795,15694098,Jackson,575,France,Female,54,NaN,68332.96,1,1,1,144390.75,0
4862,4863,15686780,Rogova,645,Spain,Female,55,1.0,133676.65,1,0,1,17095.49,0
6717,6718,15586674,Shaw,663,Spain,Female,58,5.0,216109.88,1,0,1,74176.71,1
3772,3773,15699486,Johnson,745,Spain,Male,34,7.0,132944.53,1,1,1,31802.92,0
7499,7500,15790113,Schofield,609,Germany,Female,71,6.0,113317.10,1,1,0,108258.22,1
4970,4971,15614893,Meng,689,Spain,Male,38,2.0,0.00,1,1,1,82709.80,0
981,982,15566156,Franklin,749,Germany,Female,44,NaN,71497.79,2,0,0,151083.80,0
4835,4836,15590623,Kovalyov,561,Spain,Male,34,4.0,85141.79,2,1,1,29217.37,0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           9091 non-null   float64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [79]:
print(churn_data.duplicated().sum())

0

In [80]:
churn_data.columns = churn_data.columns.str.lower()
churn_data = churn_data.rename(columns={
    'rownumber': 'row_number', 
    'customerid': 'customer_id',
    'creditscore': 'credit_score',
    'numofproducts': 'num_of_products',
    'hascrcard': 'has_cr_card',
    'isactivemember': 'is_active_member',
    'estimatedsalary': 'estimated_salary',
})
print(churn_data.columns)

Index(['row_number', 'customer_id', 'surname', 'credit_score', 'geography',
       'gender', 'age', 'tenure', 'balance', 'num_of_products', 'has_cr_card',
       'is_active_member', 'estimated_salary', 'exited'],
      dtype='object')

In [85]:
print(churn_data['customer_id'].duplicated().sum())
churn_data['surname_lowercase'] = churn_data['surname'].str.lower()

print(churn_data['surname_lowercase'].duplicated().sum())
print(churn_data.duplicated(subset=['surname_lowercase', 'gender', 'age']).sum())
print(churn_data.duplicated(subset=['surname_lowercase', 'gender', 'age', 'geography']).sum())
print(churn_data.duplicated(subset=['surname_lowercase', 'gender', 'age', 'geography', 'credit_score']).sum())
print(churn_data.duplicated(subset=['surname_lowercase', 'gender', 'age', 'geography', 'credit_score', 'estimated_salary']).sum())

churn_data.drop(['surname_lowercase'], axis=1, inplace=True)

0
7069
596
241
2
0

In [82]:
print(churn_data['tenure'].isna().value_counts())
print(churn_data.query("tenure.isna() & is_active_member == 0").count())
churn_data['tenure'] = churn_data['tenure'].where((churn_data['tenure'].notna() & churn_data['is_active_member'] == 1) , 0.0) 
print()
print(churn_data.query("tenure.isna() & is_active_member == 0").count())
print(churn_data['tenure'].isna().value_counts())
churn_data['tenure'] = pd.to_numeric(churn_data['tenure'], errors='coerce')

False    9091
True      909
Name: tenure, dtype: int64
row_number           445
customer_id          445
surname              445
credit_score         445
geography            445
gender               445
age                  445
tenure                 0
balance              445
num_of_products      445
has_cr_card          445
is_active_member     445
estimated_salary     445
exited               445
surname_lowercase    445
dtype: int64

row_number           0
customer_id          0
surname              0
credit_score         0
geography            0
gender               0
age                  0
tenure               0
balance              0
num_of_products      0
has_cr_card          0
is_active_member     0
estimated_salary     0
exited               0
surname_lowercase    0
dtype: int64
False    10000
Name: tenure, dtype: int64

In [83]:
churn_data['exited'] = churn_data['exited'].astype('boolean')

In [86]:
display(churn_data.sample(10))
churn_data.info()

,row_number,customer_id,surname,credit_score,geography,gender,age,tenure,balance,num_of_products,has_cr_card,is_active_member,estimated_salary,exited
1058,1059,15706186,McKenzie,640,Germany,Male,33,0.0,81677.22,2,0,0,34925.56,False
8331,8332,15673084,Galkin,645,Spain,Male,38,1.0,68079.80,1,0,1,166264.89,False
8756,8757,15784923,Chimezie,705,Germany,Female,37,3.0,109974.22,1,1,1,36320.87,True
9827,9828,15807312,Hsia,602,Spain,Male,33,5.0,0.00,2,0,1,64038.34,False
3927,3928,15651943,Richards,580,Spain,Female,65,1.0,0.00,2,0,1,103182.46,False
6901,6902,15637522,Shubina,507,France,Female,31,0.0,106942.08,1,0,1,44001.11,False
4757,4758,15583278,Greece,743,Spain,Female,36,8.0,92716.96,1,1,1,33693.78,False
7189,7190,15701885,Tucker,647,France,Female,40,9.0,0.00,2,0,1,92357.21,False
2508,2509,15661974,Pirozzi,677,France,Male,46,2.0,57037.74,1,1,1,158531.01,False
630,631,15712403,McMillan,589,France,Female,61,0.0,0.00,1,1,0,61108.56,True

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   row_number        10000 non-null  int64
 1   customer_id       10000 non-null  int64
 2   surname           10000 non-null  object
 3   credit_score      10000 non-null  int64
 4   geography         10000 non-null  object
 5   gender            10000 non-null  object
 6   age               10000 non-null  int64
 7   tenure            10000 non-null  float64
 8   balance           10000 non-null  float64
 9   num_of_products   10000 non-null  int64
 10  has_cr_card       10000 non-null  int64
 11  is_active_member  10000 non-null  int64
 12  estimated_salary  10000 non-null  float64
 13  exited            10000 non-null  boolean
dtypes: boolean(1), float64(3), int64(7), object(3)
memory usage: 1.0+ MB